'''برنامه ایی بنویسید که کامپیوتر یک عدد تصادفی تولید کند و کاربر آن عدد را حدس بزند اگر کاربر
عدد بزرگتر از عدد تولیدی کامپیوتر نوشت برنامه پیام دهد که عدد را کوچکتر کن اگر کاربر عدد
کوچکتر از عدد تولیدی کامپیوتر نوشت برنامه پیام دهد که عدد را بزرگتر کن و اگر دو عدد برابر باشند
پیام تبریک دهد و اجرای بازی متوقف شود.)بازی حدس عدد'(###'''
import random
hidenum=random.randint(1,10)
while True:
    x=int(input('  :بین 1 تا 10 یک عدد را حدس بزنید'))
    if x>hidenum :
        print('عدد را کوچکتر کن')
    elif x<hidenum:
        print('عدد را بزرگ کن')
    elif x==hidenum:
        print('تبریک شما درست حدس زدید و بازی به اتمام رسید')
        break