'''گروه‌بندی کاربران بر اساس زبان برنامه‌نویسی
اطلاعات کاربران:
users = [
(“Ali”, 25, “Python”),
(“Sara”, 30, “Java”),
(“Reza”, 22, “Python”),
(“Mina”, 28, “C++”),
(“John”, 35, “Python”),
(“David”, 30, “Java”)]
برنامه‌ای بنویسید که:
کاربران را بر اساس زبان برنامه‌نویسی گروه‌بندی کند.
خروجی گروه‌بندی:
{“Python”: [“Ali”, “Reza”, “John”],
“Java”: [“Sara”, “David”],
“C++”: [“Mina”] }
میانگین سن کاربران هر زبان را حساب کند.
مسن‌ترین کاربر هر زبان را پیدا کند.
زبان دارای بیشترین کاربر را پیدا کند.
تمام زبان‌های برنامه‌نویسی موجود را استخراج کند.'''