'''برنامه ای بنویسید که از کاربر بخواهد رمز عبور را وارد کند. برنامه باید رمز عبور را بر اساس معیارهای
زیر تأیید کند
طول رمز عبور باید دقیقا 8 کاراکتر باشد . چهار کاراکتر اول رمز عبور باید حروف الفبا باشد. چهار
کاراکتر آخر رمز عبور باید عدد باشد .اگر رمز عبور تمام معیارهای باالا را داشته باشد، برنامه باید
"معتبر" را نمایش دهد. در غیر این صورت، باید "نامعتبر" را نمایش دهد '''
'''len(password) # password[:4].isalpha() # password[4:].isdigit()'''
print('سلام. رمز باید 8 رقم باشد 4 حرف اول الفبا و 4 تای بعدی عدد باشد')
while True:
    x = input ('رمز را با توجه به نکات مذکور وارد کنید.')
    if len (x) == 8 and x[:4].isalpha() and x[4:].isdigit():
        print('رمز معتبر است')
        break
    else:
        print('رمز نامعتبر')